#include<stdio.h>
#include<math.h>
int main(){
	 //COMPOUND INTEREST CALCULATER
	double principal =0.0;
	double rate =0.0;
	int years =0;
	int timeCompound=0;
	double total =0.0;
	
	printf("Compound interest calculater\n");//ការបង្ហាញចំនួនដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	
	printf("Enter the  principla(P):");//ការប្រើប្រាស់សម្រាប់បញ្ចូលចំនួនដើមដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	scanf("%lf",&principal);//ការប្រើប្រាស់សម្រាប់បញ្ចូលចំនួនដើមដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	
	printf("Enter the inerest rare % (r):");//ការប្រើប្រាស់សម្រាប់បញ្ចូលអត្រាការប្រាក់ដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	scanf("%lf",&rate);//	ការប្រើប្រាស់សម្រាប់បញ្ចូលអត្រាការប្រាក់ដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	rate=rate/100;
	
	printf("Enter # of year (t):");//ការប្រើប្រាស់សម្រាប់បញ្ចូលចំនួនឆ្នាំដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	scanf("%d",&years);
	
	printf("Enter # of time compounded per year(n): ");//ការប្រើប្រាស់សម្រាប់បញ្ចូលចំនួនដងដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	scanf("%d",&timeCompound);//ការប្រើប្រាស់សម្រាប់បញ្ចូលចំនួនដងដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	total= principal*pow(1+rate/timeCompound,timeCompound*years);
	//ការគណនាដើម្បីទទួលបានតម្លៃសរុបដែលបានបូកបញ្ចូលក្នុងមួយឆ្នាំ
	
	printf("After %d years, the total will be $%.2lf",years,total);
	
	return 0;
}
